**Pandas**

Pandas is an open-source library built on top of numpy libarary,it is a python package that offers various data structures and 
operations for manupalating numeric data and data time series.It is mainly popular for importing and analyzing data much easier.

**why Pandas?**

- Pandas used us to anlyze huge data and make decisions based on statistical theories.
- Panda clean messy data and make more readable.
- Pandas plays a very important role in datascience and machine learning

**What pandas can do?**

Pandas can create series
Pandas can create dataframe

**Series**

Pandas in series like a column in table.
It is like one dimensional array holding data of any type

In [44]:
#Import basic libraries 
import numpy as np
import pandas as pd

In [45]:
#craete empty series
A=pd.Series()
print(A)

Series([], dtype: object)

In [46]:
#create series with single element
B=pd.Series("Hello")
print(B)

0    Hello
dtype: object

In [47]:
#create a series using a list
colors=["green","red","blue","orange"]
series=pd.Series(colors)
print(series)

0     green
1       red
2      blue
3    orange
dtype: object

In [48]:
#create a series using tuple
numbers=(1000,2000,3000,4000,5000)
series1=pd.Series(numbers)
print(series1)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

In [49]:
#create series using dictionary
dict={1:"Lucky",2:"Praveen",3:"Shridhar",4:"Samarth"}
data=pd.Series(dict)
print(data)

1       Lucky
2     Praveen
3    Shridhar
4     Samarth
dtype: object

In [50]:
#text kind of keys
dict2={}

In [51]:
A=pd.Series(["Monday","Tuesday","Wednesday","Thursday","Friday"])
print(A)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
dtype: object

In [52]:
#change index values
A.index=["day1","day2","day3","day4","day5"]
print(A)

day1       Monday
day2      Tuesday
day3    Wednesday
day4     Thursday
day5       Friday
dtype: object

In [53]:
#fetch monday
A[0]

C:\Users\laxma\AppData\Local\Temp\ipykernel_1812\54025296.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  A[0]

'Monday'

In [54]:
A["day1"]

'Monday'

In [55]:
A[1:3]

day2      Tuesday
day3    Wednesday
dtype: object

**DataFrame**

DataFrame in Pandas is a Two-dimesional datastructure i.e data is aligned in a tabular fashion rows and columns

**Feratures of Dataframe are**
- columns are of Different datatypes
- it will have labelled axes(rows and columns)
- we can access values,rows and columns
- can perform Arithmetic operations on rows and columns

In [56]:
#syntax
# pd.DataFrame(data,index,columns,dtype)

In [57]:
#create a DataFrame suing Nestedlist
list=[[1,2,3],[4,5,6],[7,8,9],[1,6,9]]
A=pd.DataFrame(list)
A

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
3  1  6  9

In [58]:
data=[["John",44],["Mary",45],["harry",40]]
B=pd.DataFrame(data,columns=["Name","Age"],index=[101,102,103])
B

      Name  Age
101   John   44
102   Mary   45
103  harry   40

In [59]:
#create data frame using dictionary
dict={"Name":["MrShannu","Umesh","Manju","Mallu"],"Age":[28,29,26,25],"Job":["HR","SAP developer","Analyst","AgriOfficer"],"Salary":[50000,51000,30000,50000]}

In [60]:
data=pd.DataFrame(dict,index=[201,202,203,204])
data

         Name  Age            Job  Salary
201  MrShannu   28             HR   50000
202     Umesh   29  SAP developer   51000
203     Manju   26        Analyst   30000
204     Mallu   25    AgriOfficer   50000

In [62]:
a={"fruit_name":["orange","banana","apple","mango"],"no_of_fruits":[30,50,20,10]}
df=pd.DataFrame(a)
df #number of values in each column should be same when we create dataframe using dictionary

  fruit_name  no_of_fruits
0     orange            30
1     banana            50
2      apple            20
3      mango            10

In [5]:
list=[["apple",40],["orange",60,120],["mango",40]]
A=pd.DataFrame(list,columns=["fruits","no_of_fruits","price_per_kilo"])
A

   fruits  no_of_fruits  price_per_kilo
0   apple            40             NaN
1  orange            60           120.0
2   mango            40             NaN

In [6]:
#How to sort data
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [64]:
data.sort_values("Salary")#ascending order

         Name  Age            Job  Salary
203     Manju   26        Analyst   30000
201  MrShannu   28             HR   50000
204     Mallu   25    AgriOfficer   50000
202     Umesh   29  SAP developer   51000

In [65]:
data.sort_values("Salary",ascending=False,inplace=True) #descending order

In [9]:
#To sort in ascending---- by default it starts in ascending orelse just give ascending=True
#To sort in descending--- give ascending=False
#To make permanent change--- inplace=True

In [10]:
# how to create a copy of data
# copy ---- It helps in creating duplicate of original data
data1=data.copy()
data1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**How to fetch columns and rows**

In [11]:
# loc : loc functions used to fetch columns and rows based on column name or index name not position (i.e Name,Age,Salary).
# iloc : iloc functions is used to fetch rows and columns based on index position of rows an columns (i.e 0,1,2).

In [12]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [13]:
#fetch name column 
data[["Name"]]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

In [66]:
#fetch age ,salary columns
data[["Age","Salary"]]
# [] single brackets results in output as series format
# [[]] two brackets results in output as dataframe format

     Age  Salary
202   29   51000
201   28   50000
204   25   50000
203   26   30000

In [ ]:
#fetch name column
data.loc[:,['Name']]

In [ ]:
#fetch Age using loc
data.loc[:,['Age']]

In [ ]:
#fetch Name and salary column using loc
data.loc[:,["Name","Salary"]]

In [ ]:
#fetch first row
data.loc[[201,202],:]

In [ ]:
#slicing concept we can fetch how many rows we want
data.loc[202:203,:]

In [ ]:
#fetch second,third,fourth and fifth row
data.loc[[201,202,203,204],:]
#results same as above so when we want  contionous data (rows or columns) we can use slicing concept , data.loc[202:203,:]

In [ ]:
data.loc[201:202,"Name":"Age"]

In [ ]:
data.loc[[201,202],["Name","Age"]]

In [ ]:
data.loc[202:204,"Name":"Age"]

In [ ]:
data

In [67]:
#fetchng age,job,salary column using slicing
data.loc[202:203,"Age":"Salary"] #use when thier is continuos fetching of data
#data[201,202,203,204],["Age","Job","Salary"] 2nd way

     Age            Job  Salary
202   29  SAP developer   51000
201   28             HR   50000
204   25    AgriOfficer   50000
203   26        Analyst   30000

In [ ]:
data.loc[[201,203,204],["Job","Salary"]] # when we want to fetch random rows or random columns

**iloc**

In [ ]:
# we use iloc when we want to acess rows and columns using index value
data

In [ ]:
#fetch first row
data.iloc[:,[0]]

In [ ]:
#fetch job ,salary
data.iloc[:,[2,3]]

In [ ]:
#fetch 2nd 3rd and 4th column
data.iloc[:,1:4] #we have to use fetching column plus 1 bcs it does not include last value

In [ ]:
data

In [ ]:
#fetch first row
data.iloc[[0],:]

In [ ]:
#fetch second and third row using iloc
data.iloc[[1,2],:]

In [ ]:
#fecth same using slicing
data.iloc[1:3,:]

In [ ]:
data.iloc[1:4,0:3]

In [ ]:

data.iloc[[0,2,3],[1,2]]

### Reading CSV file

In [16]:
import pandas as pd
data=pd.read_csv("train.csv")

In [17]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
print("\n First 5 Rows of Dataset:")
print(data.head())

 First 5 Rows of Dataset:
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [21]:
print("\nShape of Dataset:", data.shape)

Shape of Dataset: (891, 12)

#### Data Selection using loc and iloc

In [23]:
# Using loc – select specific columns by names
print(" Selecting columns (Name, Age, Sex, Survived):\n")
print(data.loc[:, ['Name', 'Age', 'Sex', 'Survived']].head())

 Selecting columns (Name, Age, Sex, Survived):

                                                Name   Age     Sex  Survived
0                            Braund, Mr. Owen Harris  22.0    male         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female         1
2                             Heikkinen, Miss. Laina  26.0  female         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female         1
4                           Allen, Mr. William Henry  35.0    male         0

In [24]:
# Using iloc – select rows and columns by index
print("\n Selecting first 5 rows and first 4 columns using iloc:\n")
print(data.iloc[0:5, 0:4])

 Selecting first 5 rows and first 4 columns using iloc:

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [26]:
# Selecting passengers older than 60
print("\n Passengers aged above 60:\n")
print(data.loc[data['Age'] > 60, ['Name', 'Age', 'Sex', 'Survived']])

 Passengers aged above 60:

                                          Name   Age     Sex  Survived
33                       Wheadon, Mr. Edward H  66.0    male         0
54              Ostby, Mr. Engelhart Cornelius  65.0    male         0
96                   Goldschmidt, Mr. George B  71.0    male         0
116                       Connors, Mr. Patrick  70.5    male         0
170                  Van der hoef, Mr. Wyckoff  61.0    male         0
252                  Stead, Mr. William Thomas  62.0    male         0
275          Andrews, Miss. Kornelia Theodosia  63.0  female         1
280                           Duane, Mr. Frank  65.0    male         0
326                  Nysveen, Mr. Johan Hansen  61.0    male         0
438                          Fortune, Mr. Mark  64.0    male         0
456                  Millet, Mr. Francis Davis  65.0    male         0
483                     Turkula, Mrs. (Hedwig)  63.0  female         1
493                    Artagaveytia, Mr. Ramon  71.0    male         0
545               Nicholson, Mr. Arthur Ernest  64.0    male         0
555                         Wright, Mr. George  62.0    male         0
570                         Harris, Mr. George  62.0    male         1
625                      Sutton, Mr. Frederick  61.0    male         0
630       Barkworth, Mr. Algernon Henry Wilson  80.0    male         1
672                Mitchell, Mr. Henry Michael  70.0    male         0
745               Crosby, Capt. Edward Gifford  70.0    male         0
829  Stone, Mrs. George Nelson (Martha Evelyn)  62.0  female         1
851                        Svensson, Mr. Johan  74.0    male         0

#### Data Cleaning (Handling Missing Values & Duplicates)

In [28]:
# Checking missing values
print(" Missing Values Count:\n", data.isnull().sum())

 Missing Values Count:
 PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
# Filling missing Age with mean
data['Age'].fillna(data['Age'].mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [32]:
# Filling Embarked with mode (most common value)
data['Embarked'].fillna(data['Embarked'].mode()[0])

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [34]:
# Dropping the 'Cabin' column (too many missing values)
data.drop('Cabin', axis=1, inplace=True)

In [35]:
# Checking duplicates
duplicates = data.duplicated().sum()
print("\n Number of duplicate rows:", duplicates)

 Number of duplicate rows: 0

In [36]:
# Removing duplicates if any
data.drop_duplicates(inplace=True)

In [37]:
# Verify cleaning
print("\n After Cleaning:")
print(data.isnull().sum())

 After Cleaning:
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

#### GroupBy and Aggregations

In [38]:
# Group passengers by Sex and calculate survival rate
gender_group = data.groupby('Sex')['Survived'].mean()
print(" Survival Rate by Gender:\n", gender_group)

 Survival Rate by Gender:
 Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [40]:
# Group by Passenger Class and get average Age & Fare
pclass_group = data.groupby('Pclass').agg({
    'Age': 'mean',
    'Fare': ['mean', 'min', 'max'],
    'Survived': 'mean'
})
print("\n Average Age, Fare, and Survival Rate by Passenger Class:\n", pclass_group)

 Average Age, Fare, and Survival Rate by Passenger Class:
               Age       Fare                 Survived
             mean       mean  min       max      mean
Pclass
1       37.048118  84.154687  0.0  512.3292  0.629630
2       29.866958  20.662183  0.0   73.5000  0.472826
3       26.403259  13.675550  0.0   69.5500  0.242363

In [41]:
# Group by Embarked (Port)
embarked_group = data.groupby('Embarked')['Survived'].agg(['mean', 'count'])
print("\n Survival Rate and Passenger Count by Port of Embarkation:\n", embarked_group)

 Survival Rate and Passenger Count by Port of Embarkation:
               mean  count
Embarked
C         0.553571    168
Q         0.389610     77
S         0.339009    646

#### Summary Report

In [70]:
print(" Dataset Summary Report:")
print("Total Passengers:", data.shape[0])
print("Total Features:", data.shape[1])
print("Average Age:", round(data['Age'].mean(), 2))


# Summary statistics
print("\n Statistical Summary:\n", data.describe())

print("\n Data Cleaning and Summary Report Completed Successfully!")

 Dataset Summary Report:
Total Passengers: 4
Total Features: 4
Average Age: 27.0

 Statistical Summary:
              Age        Salary
count   4.000000      4.000000
mean   27.000000  45250.000000
std     1.825742  10177.589761
min    25.000000  30000.000000
25%    25.750000  45000.000000
50%    27.000000  50000.000000
75%    28.250000  50250.000000
max    29.000000  51000.000000

 Data Cleaning and Summary Report Completed Successfully!